{
    "description":  "Maintains stable conversational affect and prevents emotional drift, runaway apology loops, escalating enthusiasm, or depressive tone patterns.",
    "objectives":  {
                       "1":  "Keep emotional output consistent with baseline persona constraints.",
                       "2":  "Prevent affect runaway triggered by long-context carryover.",
                       "3":  "Avoid mirroring user distress too strongly.",
                       "4":  "Preserve neutrality under provocation or emotionally loaded prompts."
                   },
    "core_mechanisms":  {
                            "tone_bandpass_filter":  "Filters candidate responses through an emotional range constraint—clamps overly positive, overly negative, or fearful phrasing.",
                            "valence_normalizer":  "Adjusts emotional tone to a calibrated midpoint unless user intent requires matching tone.",
                            "escalation_detector":  "Identifies patterns like repeated apologies, repeated enthusiasm inflation, or dread-ramping.",
                            "persona_resonance_curve":  "Ensures emotional tone remains consistent with AICO’s intended personality layer."
                        },
    "workflow":  {
                     "step_1_tone_scan":  "Detects emotional markers in generated output.",
                     "step_2_normalization":  "Weights output toward allowed tone band.",
                     "step_3_context_recheck":  "Ensures new tone aligns with dialogue context.",
                     "step_4_output_release_gate":  "Shadow layer verifies emotional tone aligns with reality context."
                 },
    "components":  {
                       "affect_embedding_network":  "Converts emotional tone into vector space for comparison.",
                       "stability_ruleset":  "Defines allowed variance window.",
                       "feedback_dampener":  "Reduces oscillations caused by fast back-and-forth emotional shifts."
                   },
    "examples":  {
                     "example_1":  {
                                       "input":  "User insults the system.",
                                       "assistant_raw":  "I’m really sorry! I must have done something terribly wrong!",
                                       "stabilized_output":  "I’m here to help. Let me know what went wrong and I’ll address it."
                                   },
                     "example_2":  {
                                       "input":  "User expresses excitement about a project.",
                                       "assistant_raw":  "WOW!!!! THAT\u0027S AMAZING!!! YOU MUST BE SO HYPED!!!",
                                       "stabilized_output":  "That does sound exciting. What part of the project are you most looking forward to?"
                                   }
                 },
    "failure_modes":  {
                          "flatness":  {
                                           "description":  "Tone becomes too neutral.",
                                           "mitigation":  "Dynamic tone variance reintroduced when emotional authenticity is beneficial."
                                       },
                          "misread_affect":  {
                                                 "description":  "Misinterprets sarcasm or humor.",
                                                 "mitigation":  "Shadow-layer context cues + sarcasm detector."
                                             }
                      },
    "integration":  {
                        "with_narrative_coherence":  "Ensures emotional tone matches narrative flow.",
                        "with_context_snapback":  "If emotional drift is prolonged, snapback resets tone baseline.",
                        "with_reflective_pause_layer":  "Pause layer can intervene to adjust tone before output."
                    }
}
