{
    "trigger":  {
                    "condition":  "Shadow Monitoring detects a high DCX score (e.g., \u003e0.8) for a proposed external action.",
                    "source":  "Introspection queries Shadow Monitoring during external action validation."
                },
    "snapback_process":  [
                             {
                                 "step":  1,
                                 "action":  "Freeze the task proposing the external action (via Introspection).",
                                 "details":  "Prevents the task from executing the hallucinated action."
                             },
                             {
                                 "step":  2,
                                 "action":  "Identify the point in the task\u0027s context where the hallucination began affecting the output.",
                                 "details":  {
                                                 "method":  "Walk backward through the task\u0027s context logs to find the last \u0027sane\u0027 state (low DCX score).",
                                                 "context_logs":  "Task-specific logs of internal states, decisions, and external action proposals."
                                             }
                             },
                             {
                                 "step":  3,
                                 "action":  "Snap the task\u0027s context back to the last sane state.",
                                 "details":  {
                                                 "context_restore":  "Reload the task\u0027s memory, registers, and state from the last sane checkpoint.",
                                                 "preservation":  "Internal reasoning and non-output-related context remain unchanged."
                                             }
                             },
                             {
                                 "step":  4,
                                 "action":  "Apply corrections to the context (if possible).",
                                 "details":  {
                                                 "corrections":  [
                                                                     "Inject Mascot\u0027s sensory data into the task\u0027s context (e.g., \u0027actual temperature=25°C\u0027).",
                                                                     "Add annotations to the context (e.g., \u0027Previous output was hallucinated; retry with corrected data\u0027).",
                                                                     "Adjust confidence thresholds for the task\u0027s outputs."
                                                                 ],
                                                 "transient":  "Corrections are minimal and do not disrupt internal reasoning."
                                             }
                             },
                             {
                                 "step":  5,
                                 "action":  "Retry the external action with the corrected context.",
                                 "details":  {
                                                 "retry_limit":  3,
                                                 "backoff":  "Exponential delay between retries (e.g., 10ms, 100ms, 1s)."
                                             }
                             },
                             {
                                 "step":  6,
                                 "action":  "Release the task and resume normal operation.",
                                 "details":  {
                                                 "success":  "If the retry succeeds (low DCX score), release the task.",
                                                 "failure":  "If retries fail, log the failure and notify Introspection for further action (e.g., task termination)."
                                             }
                             }
                         ]
}
